In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import ttest_ind
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn import linear_model

In [2]:
# Load dataset from vgsales.csv and display first five rows
sales_data = pd.read_csv('vgsales.csv')
sales_data.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [3]:
# Explore the dataset
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [4]:
# Explore the dataset (continued)
sales_data.describe(include="all")

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16598,16598,16327.000000,16598,16540,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
unique,NaN,11493,31,NaN,12,578,NaN,NaN,NaN,NaN,NaN
top,NaN,Need for Speed: Most Wanted,DS,NaN,Action,Electronic Arts,NaN,NaN,NaN,NaN,NaN
freq,NaN,12,2163,NaN,3316,1351,NaN,NaN,NaN,NaN,NaN
mean,8300.605254,NaN,NaN,2006.406443,NaN,NaN,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,NaN,NaN,5.828981,NaN,NaN,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,NaN,NaN,1980.000000,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,NaN,NaN,2003.000000,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,NaN,NaN,2007.000000,NaN,NaN,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,NaN,NaN,2010.000000,NaN,NaN,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,NaN,NaN,2020.000000,NaN,NaN,41.490000,29.020000,10.220000,10.570000,82.740000

In [5]:
# Load dataset from vgratings.csv and display first five rows
ratings_data = pd.read_csv('vgratings.csv')
ratings_data.head()

,Number,Name,Platform,Release_Date,Metascore,Userscore
0,1.0,The Legend of Zelda: Ocarina of Time,Nintendo 64,"November 23, 1998",99,9.1
1,2.0,Tony Hawk's Pro Skater 2,PlayStation,"September 20, 2000",98,7.4
2,3.0,Grand Theft Auto IV,PlayStation 3,"April 29, 2008",98,7.6
3,4.0,SoulCalibur,Dreamcast,"September 8, 1999",98,8.5
4,5.0,Grand Theft Auto IV,Xbox 360,"April 29, 2008",98,7.9

In [6]:
# Explore the dataset
ratings_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18009 entries, 0 to 18008
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Number        18009 non-null  float64
 1   Name          18009 non-null  object
 2   Platform      18009 non-null  object
 3   Release_Date  18009 non-null  object
 4   Metascore     18009 non-null  int64
 5   Userscore     18009 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 844.3+ KB

In [7]:
# Explore the dataset (continued)
ratings_data.describe(include="all")

,Number,Name,Platform,Release_Date,Metascore,Userscore
count,18009.000000,18009,18009,18009,18009.000000,18009
unique,NaN,11820,22,4366,NaN,95
top,NaN,Cars,PC,"November 14, 2006",NaN,tbd
freq,NaN,9,4605,48,NaN,1277
mean,9005.000000,NaN,NaN,NaN,70.405408,NaN
std,5198.894834,NaN,NaN,NaN,12.396993,NaN
min,1.000000,NaN,NaN,NaN,11.000000,NaN
25%,4503.000000,NaN,NaN,NaN,63.000000,NaN
50%,9005.000000,NaN,NaN,NaN,72.000000,NaN
75%,13507.000000,NaN,NaN,NaN,79.000000,NaN
max,18009.000000,NaN,NaN,NaN,99.000000,NaN

In [8]:
# Display all distinct platforms for each dataset
print('Distinct platforms in sales_data: ', sales_data['Platform'].unique())
print('Distinct platforms in ratings_data: ', ratings_data['Platform'].unique())

Distinct platforms in sales_data:  ['Wii' 'NES' 'GB' 'DS' 'X360' 'PS3' 'PS2' 'SNES' 'GBA' '3DS' 'PS4' 'N64'
 'PS' 'XB' 'PC' '2600' 'PSP' 'XOne' 'GC' 'WiiU' 'GEN' 'DC' 'PSV' 'SAT'
 'SCD' 'WS' 'NG' 'TG16' '3DO' 'GG' 'PCFX']
Distinct platforms in ratings_data:  ['Nintendo 64' 'PlayStation' 'PlayStation 3' 'Dreamcast' 'Xbox 360' 'Wii'
 'Xbox One' 'Switch' 'PlayStation 2' 'PlayStation 4' 'GameCube' 'Xbox'
 'PC' 'Wii U' 'Game Boy Advance' '3DS' 'DS' 'PlayStation Vita'
 'PlayStation 5' 'PSP' 'Xbox Series X' 'Stadia']

In [9]:
# Display number of unique games and platforms for each dataset
print('# of unique games in sales_data: ', sales_data['Name'].unique().size)
print('# of unique games in ratings_data: ', ratings_data['Name'].unique().size)
print('# of unique platforms in sales_data: ', sales_data['Platform'].unique().size)
print('# of unique platforms in ratings_data: ', ratings_data['Platform'].unique().size)

# of unique games in sales_data:  11493
# of unique games in ratings_data:  11820
# of unique platforms in sales_data:  31
# of unique platforms in ratings_data:  22

In [10]:
# Replace the abbreviated 'Platform' data in sales_data w/ its full abbreviation
abbreviated_platforms = {
    "Wii": "Wii",
    "NES": "Nintendo Entertainment System",
    "GB": "Game Boy",
    "DS": "DS",
    "X360": "Xbox 360",
    "PS3": "PlayStation 3",
    "PS2": "PlayStation 2",
    "SNES": "Super Nintendo Entertainment System",
    "GBA": "Game Boy Advance",
    "3DS": "3DS",
    "PS4": "PlayStation 4",
    "N64": "Nintendo 64",
    "PS": "PlayStation",
    "XB": "Xbox",
    "PC": "PC",
    "2600": "Atari 2600",
    "PSP": "PSP",
    "XOne": "Xbox One",
    "GC": "GameCube",
    "WiiU": "Wii U",
    "GEN": "Sega Genesis",
    "DC": "Dreamcast",
    "PSV": "PlayStation Vita",
    "SAT": "Sega Saturn",
    "SCD": "SCD",
    "WS": "WonderSwan",
    "NG": "NG",
    "TG16": "TurboGrafx-16",
    "3DO": "3DO Interactive Multiplayer",
    "GG": "Game Gear",
    "PCFX": "PC-FX",
}
sales_data['Platform'] = sales_data['Platform'].map(abbreviated_platforms)
print('Distinct platforms in sales_data: ', sales_data['Platform'].unique())
print('Distinct platforms in ratings_data: ', ratings_data['Platform'].unique())

Distinct platforms in sales_data:  ['Wii' 'Nintendo Entertainment System' 'Game Boy' 'DS' 'Xbox 360'
 'PlayStation 3' 'PlayStation 2' 'Super Nintendo Entertainment System'
 'Game Boy Advance' '3DS' 'PlayStation 4' 'Nintendo 64' 'PlayStation'
 'Xbox' 'PC' 'Atari 2600' 'PSP' 'Xbox One' 'GameCube' 'Wii U'
 'Sega Genesis' 'Dreamcast' 'PlayStation Vita' 'Sega Saturn' 'SCD'
 'WonderSwan' 'NG' 'TurboGrafx-16' '3DO Interactive Multiplayer'
 'Game Gear' 'PC-FX']
Distinct platforms in ratings_data:  ['Nintendo 64' 'PlayStation' 'PlayStation 3' 'Dreamcast' 'Xbox 360' 'Wii'
 'Xbox One' 'Switch' 'PlayStation 2' 'PlayStation 4' 'GameCube' 'Xbox'
 'PC' 'Wii U' 'Game Boy Advance' '3DS' 'DS' 'PlayStation Vita'
 'PlayStation 5' 'PSP' 'Xbox Series X' 'Stadia']

In [11]:
# Drop 'Rank' in sales_data
sales_data = sales_data.drop(columns=['Rank'])
sales_data.shape

(16598, 10)

In [12]:
# Replace 'Publisher' missing values in sales_data (e.g., with 'Unknown')
sales_data['Publisher'] = sales_data['Publisher'].fillna('Unknown')
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16598 non-null  object
 1   Platform      16598 non-null  object
 2   Year          16327 non-null  float64
 3   Genre         16598 non-null  object
 4   Publisher     16598 non-null  object
 5   NA_Sales      16598 non-null  float64
 6   EU_Sales      16598 non-null  float64
 7   JP_Sales      16598 non-null  float64
 8   Other_Sales   16598 non-null  float64
 9   Global_Sales  16598 non-null  float64
dtypes: float64(6), object(4)
memory usage: 1.3+ MB

In [13]:
# Drop missing values from variable 'Year' in sales_data
sales_data = sales_data.dropna()
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16327 entries, 0 to 16597
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16327 non-null  object
 1   Platform      16327 non-null  object
 2   Year          16327 non-null  float64
 3   Genre         16327 non-null  object
 4   Publisher     16327 non-null  object
 5   NA_Sales      16327 non-null  float64
 6   EU_Sales      16327 non-null  float64
 7   JP_Sales      16327 non-null  float64
 8   Other_Sales   16327 non-null  float64
 9   Global_Sales  16327 non-null  float64
dtypes: float64(6), object(4)
memory usage: 1.4+ MB

In [14]:
# Convert the variable 'Year' in sales_data from type float64 to type int64
sales_data['Year'] = sales_data['Year'].map(lambda x: int(x))
print('Year type:', type(sales_data['Year'][0]))

Year type: <class 'numpy.int64'>

In [15]:
# Drop 'Number' in sales_data
ratings_data = ratings_data.drop(columns=['Number'])
ratings_data.shape

(18009, 5)

In [16]:
# Replace 'tbd' values in ratings_data with np.nan and convert 'Userscore' variable to type float64
ratings_data['Userscore'] = ratings_data['Userscore'].replace('tbd', np.nan).astype(float)
print('Userscore type:', type(ratings_data['Userscore'][0]))
ratings_data[ratings_data.isna().any(axis=1)]

Userscore type: <class 'numpy.float64'>

,Name,Platform,Release_Date,Metascore,Userscore
497,Madden NFL 2005,GameCube,"August 9, 2004",90,NaN
924,Tiger Woods PGA Tour 2005,GameCube,"September 20, 2004",88,NaN
1220,NASCAR 2005: Chase for the Cup,Xbox,"August 31, 2004",86,NaN
1410,Moto Racer Advance,Game Boy Advance,"December 5, 2002",86,NaN
2109,Pinball FX 2: Marvel Pinball - Vengeance and V...,Xbox 360,"December 13, 2011",84,NaN
...,...,...,...,...,...
17817,Jackass the Game,DS,"January 8, 2008",35,NaN
17840,King of Clubs,Wii,"August 4, 2008",35,NaN
17900,Jenga World Tour,DS,"November 13, 2007",32,NaN
17915,Dream Chronicles,PlayStation 3,"November 23, 2010",31,NaN
17917,Smash 'N' Survive,PlayStation 3,"February 22, 2012",31,NaN

In [17]:
# Create a new variable named 'Year' in the ratings_data from the 'Release_Date' variable
ratings_data['Year'] = ratings_data['Release_Date'].map(lambda str: int(str.split()[2]))
ratings_data.head()

,Name,Platform,Release_Date,Metascore,Userscore,Year
0,The Legend of Zelda: Ocarina of Time,Nintendo 64,"November 23, 1998",99,9.1,1998
1,Tony Hawk's Pro Skater 2,PlayStation,"September 20, 2000",98,7.4,2000
2,Grand Theft Auto IV,PlayStation 3,"April 29, 2008",98,7.6,2008
3,SoulCalibur,Dreamcast,"September 8, 1999",98,8.5,1999
4,Grand Theft Auto IV,Xbox 360,"April 29, 2008",98,7.9,2008

In [18]:
# Drop missing values from variable 'Userscore' in ratings_data
ratings_data = ratings_data.dropna()
ratings_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16732 entries, 0 to 18008
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16732 non-null  object
 1   Platform      16732 non-null  object
 2   Release_Date  16732 non-null  object
 3   Metascore     16732 non-null  int64
 4   Userscore     16732 non-null  float64
 5   Year          16732 non-null  int64
dtypes: float64(1), int64(2), object(3)
memory usage: 915.0+ KB

In [19]:
# Lowercase variable 'Name' on both datasets
sales_data['Name'] = sales_data['Name'].str.lower()
ratings_data['Name'] = ratings_data['Name'].str.lower()

In [22]:
# Merge both datasets into one using 'Name', 'Platform' and 'Year' and drop 'Year'
data = pd.merge(sales_data, ratings_data, how="inner", on=['Name', 'Platform', 'Year'])
data = data.drop(columns=['Year'])
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5733 entries, 0 to 5732
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          5733 non-null   object
 1   Platform      5733 non-null   object
 2   Genre         5733 non-null   object
 3   Publisher     5733 non-null   object
 4   NA_Sales      5733 non-null   float64
 5   EU_Sales      5733 non-null   float64
 6   JP_Sales      5733 non-null   float64
 7   Other_Sales   5733 non-null   float64
 8   Global_Sales  5733 non-null   float64
 9   Release_Date  5733 non-null   object
 10  Metascore     5733 non-null   int64
 11  Userscore     5733 non-null   float64
dtypes: float64(6), int64(1), object(5)
memory usage: 582.3+ KB

In [23]:
# Explore the merged dataset
data.describe(include="all")

,Name,Platform,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Release_Date,Metascore,Userscore
count,5733,5733,5733,5733,5733.000000,5733.000000,5733.000000,5733.000000,5733.000000,5733,5733.000000,5733.000000
unique,3614,18,12,215,NaN,NaN,NaN,NaN,NaN,1772,NaN,NaN
top,madden nfl 07,PlayStation 2,Action,Electronic Arts,NaN,NaN,NaN,NaN,NaN,"November 14, 2006",NaN,NaN
freq,7,931,1387,837,NaN,NaN,NaN,NaN,NaN,29,NaN,NaN
mean,NaN,NaN,NaN,NaN,0.431366,0.255125,0.051877,0.086984,0.825575,NaN,71.113553,7.185086
std,NaN,NaN,NaN,NaN,1.028085,0.709980,0.250638,0.267003,2.038636,NaN,13.522610,1.335299
min,NaN,NaN,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.010000,NaN,17.000000,1.300000
25%,NaN,NaN,NaN,NaN,0.070000,0.020000,0.000000,0.010000,0.120000,NaN,63.000000,6.500000
50%,NaN,NaN,NaN,NaN,0.170000,0.070000,0.000000,0.020000,0.320000,NaN,73.000000,7.500000
75%,NaN,NaN,NaN,NaN,0.430000,0.230000,0.010000,0.080000,0.820000,NaN,81.000000,8.100000
max,NaN,NaN,NaN,NaN,41.490000,29.020000,6.500000,10.570000,82.740000,NaN,99.000000,9.800000